/**
上题基础上，找出有不及格课程的学生及学号
定义函数指针：字符类型(*指针变量名称)(参数列表)
定义二维数组指针：字符类型(*指针变量名称名称)[列]            把二维当一位去定义，括号内加行，括号外加列
**/
#include <stdio.h>
void main()
{
    double score[3][4] = {{60.0, 70.0, 80.5, 90.0}, {56.0, 89.0, 67.0, 88.0}, {34.2, 78.5, 90.6, 40.0}};
    double *select(double(*a)[4]);
        //定义函数指针：     字符类型(*指针变量名)(变量)
        //定义二维数组指针： 字符类型(*指针变量名)[长度]

    double *p;
    int i;

    p = select(score);
    for(i=0; i<4; i++)
    {
        printf("%f\t", *(p+i));
    }

}
double *select(double(*a)[4])
{
    int i,j;
    double *pl, *pl2, *pl3;
    pl = *a;
    for(i=0; i<3; i++)//*(p+i++)是行地址，由右到左，所以先算i++
    {

        pl2=pl+i;
        for(j=0; j<4; j++)//*(p+i++)+j++是列地址
        {
            pl3=pl2+j;
            if( *(pl3) < 60.0) //*(*(p+i++)+j++) 二维数组双*是取值
            {
                return pl3;
            }
        }
    }
}
