/*******************************************
运输公司计费表
距离越远费用越低
s<250km         不打折
250<=s<500      2%折扣
500<=s<1000     5%折扣
1000<=s<2000    8%折扣
2000<=s<3000    10%折扣
3000<=s         15%折扣
每吨货物运费p，货重w，距离s，折扣d，
总运费f=p*w*s*(1-d)
*******************************************/
/* 用if-else if 语句*/
#include <stdio.h>
void main()
{   float p, w, f;
    int s;          //不管是否判断赋值，只要用这个字母就得定义
    printf("input 运费p 货重w 距离s:");
    scanf("%f%f%d", &p, &w, &s);  //定义什么字母，储存&什么字母
    if(s<250)                     //注意定义的数字类型（经常写错）
    {                             //int对应%d float对应%f char对应%c
        f=p*w*s*(1);
    }
    else if(s>=250&&s<500)
    {
        f=p*w*s*(1-0.02);
    }
    else if(s>=500&&s<1000)
    {
        f=p*w*s*(1-0.05);
    }
    else if(s>=1000&&s<2000)   //要用与&&符号if里连接两个比较
    {                          //if(s>=1000&&s<2000) 对的
        f=p*w*s*(1-0.08);      //if(1000<=s<2000)    错的
    }                          //因为 if语句判断真或假 写成第二种 出来的结果永远为1 第一种则可以判断真假
    else if(s>=2000&&s<3000)
    {
        f=p*w*s*(1-0.1);
    }
    else if(s>=3000)
    {
        f=p*w*s*(1-0.18);
    }
    else
    {
        printf("error error");
    }
    printf("end price=%15.4f", f);
}




