#include <stdio.h>
void main()
{
    char c='k';  /*定义c为字符串‘k’ 实际是对应asc码107*/
    int i=1, j=2, k=3;
    float x=3e+5, y=0.85; /*3e的e是10*/
    printf("%d,%d\n", !x*!y, !!!x); /*优先次序 任何数的非!都是0*/
    printf("%d,%d\n", x||i&&j-3, i<j&&x<y);
    printf("%d,%d\n", i==5&&c&&(j==8), x+y||i+j+k);
}


/*
注意运算优先次序 总:括号-非-算数-关系-与非-赋值
             逻辑小:非!-与&&-或||
             关系小:< <= > >+ --- == !=
             四大天王最优先
*/
/*
与&&非||  双目运算  左结合性
非！      单目运算  右结合性
*/
/*
输出值只能为1或0 真是1 假是0
第一行:0,0
第二行:1,0
第三行:0,1
*/
