/**
赋值这样一个表格，并求分科平均成绩和总平均成绩
             张     王     李     赵     周
    match    80     61     59     85      76
    china    75     65     63     87      77
    foxpro   92     71     70     90      85
用for循环取成绩a[j][i]
**/
#include <stdio.h>
void main()
{
    int a[3][5]={{80,61,59,85,76},{75,65,63,87,77},{92,71,70,90,85}};
       //3*5，先给行(后面)赋值
    int i, j, sum=0, v[3];//v为空的一维数组,也放入循环中,代表科目平均值
    for(i=0; i<=2; i++) //从a[0]开始
    {
        for(j=0; j<=4; j++)
            {
                sum = sum + a[i][j];
            }
        v[i]=sum/5;//弄个一维数组在循环里很巧妙
        sum=0; //循环完了一定要给sum赋值0再循环，这样就不会出现叠加问题
    }
    printf("math=%d\t china=%d\tfoxpro=%d\t\n", v[1], v[2], v[3]);
    printf("average=%d", (v[1]+v[2]+v[3])/3);
}
