/**
矩阵转秩
把a[2][3]化成b[3][2]
a= 1 2 3      b= 1 4
   4 5 6         2 5
                 3 6
肯定是先赋值在for语句提取转换
化繁为简:不论多少数组，分解成一维的先转换
          a[0][j]转换b[j][0]
    再    b[j][0]转换b[j][i]

要点:两个循环，层层转换b[j][i]=a[i][j]
       先转换1行,列+1
       在行+1，列逐渐+1
       在行+1，列逐渐+1
**/
#include <stdio.h>
void main()
{
    int a[2][3]={{1,2,3},{4,5,6}};
    int b[3][2];
    int i, j;
    for(i=0; i<=1; i++)
    {
       for(j=0; j<=2; j++)
       {
           b[j][i]=a[i][j];
       }
    }

    for(j=0; j<=2; j++)//打印数字
    {
        for(i=0; i<=1; i++)
        {
            printf("%d ", b[j][i]);
        }
        printf("\n");
    }
}
