/**
输入9个数，按九宫格形式保存在二维数组中
按原来位置输出第一行和第一列所有元素

动态赋值，三个赋值完了\n
没有数的地方输出空格,找输出数的特点
1 2 3     输出   2
4 5 6          4 5 6
7 8 9            8

((i+j)%2!=0||(i%2!=0&&j%2!=0))
  空的地方i+j是偶数
显示的地方i+j是奇数
中间1,1是例外，加个或语句,ij同为奇数也输出
**/

#include <stdio.h>
void main()
{
    int a[3][3]; //先定义二维数组的长度
    int i, j;
    printf("please intput nine number\n");

    for(i=0; i<3; i++) //用循环动态赋值
    {
        for(j=0; j<3; j++)
        {
            scanf("%d", &a[i][j]);
        }
    }

    for(i=0; i<=2; i++)//i<=2和i<3是一样的
    {                  //找输出位置的规律
        for(j=0; j<=2; j++)
            {
                if((i+j)%2!=0||(i%2!=0&&j%2!=0))//中间1,1是例外，加个或语句,ij同为奇数也输出
                                                //  空的地方i+j是偶数
                                                //显示的地方i+j是奇数
                {
                    printf("%d ", a[i][j]);
                }
                else
                {
                    printf("  ");
                }

            }
        printf("\n");//每显示完一行就换行
    }
}
