/**
1.数组元素 作 实参
  数组元素即下标变量，如a[1]就是第2个这个位置元素值
                         a[2][3]就是二维3*4这个位置的元素值
  因此实参使用与普通变量完全相同，调用时把数组元素作为实参传递给形参

例题:判断一维数组a[10]={1,2,3,4,-1,-2,-3,-4,2,3}的元素
     大于0输出该值，小于0输出0
**/
#include <stdio.h>
int put(int n);//先声明函数

void main()
{
    int a[10]={1,2,3,4,-1,-2,-3,-4,2,3};//定义数组
    int i;
    for(i=0; i<=9; i++)//用循环把数组元素(下标)挨个比较
    {
     put(a[i]); //用put函数,用定义的算出来在返回
                //引用数组元素，不是引用数组名(整个数组)
     printf("%d\t", put(a[i]));
    }
}
int put(int n)//定义函数
{
    int temp;
    if(n>0)//这个函数里a[i]就是n
    {
        temp = n;
        return temp;
    }
    else
    {
       temp = 0;
       return temp;
    }
}




